# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
#  простые множетели: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101,
# 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199...

value = int(input('Введите натуральное положительное число: '))
simple_numbars = []
i = 2

while i <= value:
    if value % i == 0:
        value /= i
        simple_numbars.append(i)
    else:
        i += 1
print(simple_numbars)
